
## Plan Result (prod)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 1 to change, 1 to destroy.</code></pre>

* Update
  * module.redis6-cache.azurerm_redis_cache.redis
* Replace
  * module.application_insights.azurerm_monitor_activity_log_alert.main[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.application_insights.azurerm_monitor_activity_log_alert.main[0] must be replaced
-/+ resource "azurerm_monitor_activity_log_alert" "main" {
      ~ id                  = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/cui-shared-prod/providers/Microsoft.Insights/activityLogAlerts/Application Insights daily cap reached - cui-prod" -> (known after apply)
      ~ location            = "global" -> "uksouth" # forces replacement
        name                = "Application Insights daily cap reached - cui-prod"
        tags                = {
            "application"         = "cui-ra"
            "builtFrom"           = "https://github.com/HMCTS/cui-ra.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#cui-ra-support"
            "environment"         = "production"
            "managedBy"           = "CUI-RA"
        }
        # (4 unchanged attributes hidden)

      ~ criteria {
          - levels                  = [] -> null
          - resource_groups         = [] -> null
          - resource_ids            = [] -> null
          - resource_providers      = [] -> null
          - resource_types          = [] -> null
          - statuses                = [] -> null
          - sub_statuses            = [] -> null
            # (13 unchanged attributes hidden)

          ~ resource_health {
              + caller                  = (known after apply)
              + category                = (known after apply)
              + level                   = (known after apply)
              + levels                  = (known after apply)
              + operation_name          = (known after apply)
              + recommendation_category = (known after apply)
              + recommendation_impact   = (known after apply)
              + recommendation_type     = (known after apply)
              + resource_group          = (known after apply)
              + resource_groups         = (known after apply)
              + resource_id             = (known after apply)
              + resource_ids            = (known after apply)
              + resource_provider       = (known after apply)
              + resource_providers      = (known after apply)
              + resource_type           = (known after apply)
              + resource_types          = (known after apply)
              + status                  = (known after apply)
              + statuses                = (known after apply)
              + sub_status              = (known after apply)
              + sub_statuses            = (known after apply)
            } -> (known after apply)

          ~ service_health {
              + caller                  = (known after apply)
              + category                = (known after apply)
              + level                   = (known after apply)
              + levels                  = (known after apply)
              + operation_name          = (known after apply)
              + recommendation_category = (known after apply)
              + recommendation_impact   = (known after apply)
              + recommendation_type     = (known after apply)
              + resource_group          = (known after apply)
              + resource_groups         = (known after apply)
              + resource_id             = (known after apply)
              + resource_ids            = (known after apply)
              + resource_provider       = (known after apply)
              + resource_providers      = (known after apply)
              + resource_type           = (known after apply)
              + resource_types          = (known after apply)
              + status                  = (known after apply)
              + statuses                = (known after apply)
              + sub_status              = (known after apply)
              + sub_statuses            = (known after apply)
            } -> (known after apply)
        }

        # (1 unchanged block hidden)
    }

  # module.redis6-cache.azurerm_redis_cache.redis will be updated in-place
  ~ resource "azurerm_redis_cache" "redis" {
        id                                 = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/cui-cache-prod/providers/Microsoft.Cache/redis/cui-ra-prod"
        name                               = "cui-ra-prod"
        tags                               = {
            "application"         = "cui-ra"
            "builtFrom"           = "https://github.com/HMCTS/cui-ra.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#cui-ra-support"
            "environment"         = "production"
            "managedBy"           = "CUI-RA"
        }
        # (24 unchanged attributes hidden)

      ~ redis_configuration {
          - data_persistence_authentication_method  = "SAS" -> null
            # (16 unchanged attributes hidden)
        }
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":618,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->